In [1]:
%matplotlib inline
import pandas as pd

In [2]:
 data1= pd.read_csv('titles.csv')

In [3]:
data1.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [12]:
data1.size

489828

### How many movies are listed in the titles dataframe?

In [4]:
data1.count(axis=0)

title    244914
year     244914
dtype: int64

In [7]:
a=len(data1.axes[0])
print("No. of movies listed are: ",a)

No. of movies listed are:  244914

### What are the earliest two films listed in the titles dataframe?

In [8]:
data1.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [9]:

b=len(data1[data1['title'] == 'Hamlet'])
print("The no. of movies having title of 'Hamlet' is:",b)

The no. of movies having title of 'Hamlet' is: 20

        title  year
6422   Hamlet  2017
10637  Hamlet  1921

### How many movies are titled "North by Northwest"?

In [11]:
c=len(data1[data1['title'] == 'North by Northwest'])
print("The no. of movies having title of 'North by Northwest' is:",c)

The no. of movies having title of 'North by Northwest' is: 1

### When was the first movie titled "Hamlet" made?

In [19]:
b=data1[data1['title'] == 'Hamlet'].sort_values('year')
c=b.sort_values('year')
b.head(1)
#b.sort_values("year", axis = 0, ascending = True, inplace = True, na_position ='first')

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [20]:
data1[data1['title'] == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [23]:
d=len(data1[data1['year'] == '1950'])
print('The numbers of movies made in the year 1950 = ', d)

The numbers of movies made in the year 1950 =  0

### How many movies were made in the year 1960?

In [24]:
d=len(data1[data1['year'] == '1960'])
print('The numbers of movies made in the year 1960 = ', d)

The numbers of movies made in the year 1950 =  0

### How many movies were made from 1950 through 1959?

In [32]:
x = data1['year'].between(1950, 1959, inclusive = True)
print('The numbers of movies made from 1950 through 1950 = ',len(data1[x]))

The numbers of movies made from 1950 through 1950 =  12934

### In what years has a movie titled "Batman" been released?

In [52]:
a=data1[data1['title'] == 'Batman']
print(a['year'])

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [4]:
data2= pd.read_csv('cast.csv')
y=len(data2[data2['title'] == 'Inception'])
print('The Number of roles in the movie "Inception" were = ',y)

The Number of roles in the movie "Inception" were =  78

In [18]:
data2.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [19]:
z=data2[data2['title'] == 'Inception']
a=z.isna().sum()
print(' The numbers of roles in the movie "Inception" that are NOT ranked by an "n" value =  ',a['n'])

 The numbers of roles in the movie "Inception" that are NOT ranked by an "n" value =   27

### But how many roles in the movie "Inception" did receive an "n" value?

In [22]:
y=len(data2[data2['title'] == 'Inception'])
a=z.isna().sum()
c=y-a['n']
print(' The numbers of roles in the movie "Inception" that did received an"n" value =  ', c)

 The numbers of roles in the movie "Inception" that did received an"n" value =   51

In [23]:
a=z.notna().sum()
print(a['n'])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [35]:
y=data2[data2['title'] == 'North by Northwest']
x=y.dropna()
print(x.sort_values('n'))

                      title  year                  name     type  \
871426   North by Northwest  1959            Cary Grant    actor
3518333  North by Northwest  1959       Eva Marie Saint  actress
1457165  North by Northwest  1959           James Mason    actor
3157232  North by Northwest  1959   Jessie Royce Landis  actress
356707   North by Northwest  1959        Leo G. Carroll    actor
3048272  North by Northwest  1959  Josephine Hutchinson  actress
1695173  North by Northwest  1959           Philip Ober    actor
1275337  North by Northwest  1959         Martin Landau    actor
2447081  North by Northwest  1959         Adam Williams    actor
1811387  North by Northwest  1959          Edward Platt    actor
665768   North by Northwest  1959     Robert Ellenstein    actor
2295714  North by Northwest  1959          Les Tremayne    actor
464736   North by Northwest  1959       Philip Coolidge    actor
1508344  North by Northwest  1959         Patrick McVey    actor
206471   North by Northwest  1959          Edward Binns    actor
1384780  North by Northwest  1959             Ken Lynch    actor

                           character     n
871426            Roger O. Thornhill   1.0
3518333                  Eve Kendall   2.0
1457165              Phillip Vandamm   3.0
3157232              Clara Thornhill   4.0
356707                 The Professor   5.0
3048272                Mrs. Townsend   6.0
1695173              Lester Townsend   7.0
1275337                      Leonard   8.0
2447081                     Valerian   9.0
1811387              Victor Larrabee  10.0
665768                         Licht  11.0
2295714                   Auctioneer  12.0
464736                     Dr. Cross  13.0
1508344               Sergeant Flamm  14.0
206471                Captain Junket  15.0
1384780  Charley - Chicago Policeman  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [66]:
x=data2[data2['title'] == 'Sleuth' ] 
x[x['year'] == 1972].sort_values('n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [65]:
y=data2[data2['title'] == 'Sleuth' ] 
y[y['year'] == 2007].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [69]:
x=data2[data2['title'] == 'Hamlet' ]
y=x[x['year'] == 1921]
print('The roles were credited in the silent 1921 version of Hamlet =',len(y))

The roles were credited in the silent 1921 version of Hamlet = 9

In [70]:
print(y)

          title  year                    name     type         character    n
7789     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
458904   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
555034   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1135279  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2185558  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2375993  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2664423  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
3062023  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3355176  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

### How many roles were credited in Branagh’s 1996 Hamlet?

In [72]:
x=data2[data2['title'] == 'Hamlet' ]
y=x[x['year'] == 1996]
print('The roles were credited in the Branagh’s 1996 version of Hamlet =',len(y))

The roles were credited in the Branagh’s 1996 version of Hamlet = 54

In [73]:
print(y)

          title  year                    name     type  \
1731     Hamlet  1996              Riz Abbasi    actor
95861    Hamlet  1996    Richard Attenborough    actor
158642   Hamlet  1996     Simon Russell Beale    actor
214473   Hamlet  1996         David (V) Blair    actor
219554   Hamlet  1996           Brian Blessed    actor
250773   Hamlet  1996      Christopher Bowles    actor
260225   Hamlet  1996         Kenneth Branagh    actor
272749   Hamlet  1996          Richard Briers    actor
294652   Hamlet  1996          Michael Bryant    actor
319501   Hamlet  1996            Peter Bygott    actor
344365   Hamlet  1996       Kenneth W Caravan    actor
500916   Hamlet  1996           Billy Crystal    actor
518572   Hamlet  1996           Charles Daish    actor
576147   Hamlet  1996        G?rard Depardieu    actor
598618   Hamlet  1996          Reece Dinsdale    actor
604339   Hamlet  1996                Ken Dodd    actor
656817   Hamlet  1996             Rob Edwards    actor
669232   Hamlet  1996             Jimmy Ellis    actor
704270   Hamlet  1996        Nicholas Farrell    actor
708468   Hamlet  1996              Ray Fearon    actor
827066   Hamlet  1996            John Gielgud    actor
990819   Hamlet  1996         Charlton Heston    actor
1074691  Hamlet  1996           Ravil Isyanov    actor
1082161  Hamlet  1996            Derek Jacobi    actor
1210509  Hamlet  1996         Jeffery Kissoon    actor
1316617  Hamlet  1996             Jack Lemmon    actor
1400732  Hamlet  1996       Anthony Maddalena    actor
1417360  Hamlet  1996         Michael Maloney    actor
1489191  Hamlet  1996          Ian McElhinney    actor
1549128  Hamlet  1996              John Mills    actor
1556082  Hamlet  1996             Jimi Mistry    actor
1588218  Hamlet  1996       Frank (II) Morgan    actor
2040040  Hamlet  1996        Andrew Schofield    actor
2052796  Hamlet  1996           Orlando Seale    actor
2067657  Hamlet  1996            Rufus Sewell    actor
2151526  Hamlet  1996           Timothy Spall    actor
2154960  Hamlet  1996  John Spencer-Churchill    actor
2221910  Hamlet  1996         Thomas Szekeres    actor
2259675  Hamlet  1996                Ben Thom    actor
2404091  Hamlet  1996          Don Warrington    actor
2453099  Hamlet  1996          Robin Williams    actor
2500066  Hamlet  1996               David Yip    actor
2508377  Hamlet  1996             Jimmy Yuill    actor
2737885  Hamlet  1996          Julie Christie  actress
2814220  Hamlet  1996              Judi Dench  actress
2835947  Hamlet  1996          Angela Douglas  actress
2940033  Hamlet  1996           Yvonne Gidden  actress
2999610  Hamlet  1996         Rosemary Harris  actress
3119901  Hamlet  1996             Rowena King  actress
3154270  Hamlet  1996               Sarah Lam  actress
3451003  Hamlet  1996           Sian Radinger  actress
3456114  Hamlet  1996          Melanie Ramsay  actress
3728751  Hamlet  1996           Perdita Weeks  actress
3751232  Hamlet  1996            Kate Winslet  actress

                        character     n
1731        Attendant to Claudius   1.0
95861          English Ambassador   2.0
158642         Second Gravedigger  37.0
214473      Attendant to Claudius   3.0
219554   Ghost of Hamlet's Father   4.0
250773              Cadet in Play   NaN
260225                     Hamlet   5.0
272749                   Polonius   6.0
294652                     Priest   7.0
319501      Attendant to Claudius   8.0
344365                Laertes Mob   NaN
500916          First Gravedigger  10.0
518572              Stage Manager  11.0
576147                   Reynaldo  13.0
598618               Guildenstern  14.0
604339                     Yorick  15.0
656817                   Lucianus  17.0
669232             Old Fortinbras   NaN
704270                    Horatio  18.0
708468                  Francisco  19.0
827066                      Priam  21.0
990819                Player King  23.0
1074691                 Cornelius  24.0
1082161                  Claudius  25.0
1210509      Fortinbras's Captain  27.0
1316617                 Marcellus  29.0
1400732         Elsinore Courtier   NaN
1417360                   Laertes  31.0
1489191                  Barnardo  30.0
1549128                Old Norway  33.0
1556082                Sailor Two  34.0
1588218                   Pyrrhus   NaN
2040040                Young Lord  38.0
2052796                   Boatman   NaN
2067657                Fortinbras  39.0
2151526               Rosencrantz  40.0
2154960      Fortinbras's Captain  32.0
2221910              Young Hamlet  41.0
2259675              First Player  42.0
2404091                 Voltimand  43.0
2453099                     Osric  45.0
2500066                Sailor One  47.0
2508377                 Alexander   NaN
2737885                  Gertrude   9.0
2814220                    Hecuba  12.0
2835947     Attendant to Gertrude  16.0
2940033                    Doctor  20.0
2999610              Player Queen  22.0
3119901     Attendant to Gertrude  26.0
3154270     Attendant to Gertrude  28.0
3451003                  Prologue  35.0
3456114                Prostitute   NaN
3728751             Second Player  44.0
3751232                   Ophelia  46.0

### How many "Hamlet" roles have been listed in all film credits through history?

In [74]:
x=data2[data2['title'] == 'Hamlet' ]
print('The no. of  "Hamlet" roles have been listed in all film credits through history = ',len(x))

The no. of  "Hamlet" roles have been listed in all film credits through history =  342

In [75]:
print(x)

          title  year              name     type              character     n
1731     Hamlet  1996        Riz Abbasi    actor  Attendant to Claudius   1.0
7789     Hamlet  1921  Fritz Achterberg    actor            Fortinbras,   9.0
11728    Hamlet  2009      Hayden Adams    actor                Laertes   7.0
11729    Hamlet  2009      Hayden Adams    actor                 Player   7.0
14493    Hamlet  1913       Eric Adeney    actor               Reynaldo  14.0
...         ...   ...               ...      ...                    ...   ...
3673234  Hamlet  1969    Jennifer Tudor  actress             Court lady  23.0
3697397  Hamlet  2000      Diane Venora  actress               Gertrude   3.0
3728751  Hamlet  1996     Perdita Weeks  actress          Second Player  44.0
3733637  Hamlet  2015   Katie (II) West  actress                Ophelia   7.0
3751232  Hamlet  1996      Kate Winslet  actress                Ophelia  46.0

[342 rows x 6 columns]

### How many people have played an "Ophelia"?

In [84]:
x=data2[data2['character'] == 'Ophelia' ]
print('The numbers of peopel have palyed an"Ophelia" =  ',len(x))
print(x)

The numbers of peopel have palyed an"Ophelia" =   117
                                                     title  year  \
248251                          The Merry Maids of Madness  2016
410247                                      Jake Gets Paid  2009
470859                                          Inoperable  2017
866334                     Dogg's Hamlet, Cahoot's Macbeth  2005
1364457                                                 11  2014
...                                                    ...   ...
3722298                                           D.C. Cab  1983
3723039                                           Creature  2011
3733637                                             Hamlet  2015
3748118  National Theatre Live: Rosencrantz & Guildenst...  2017
3751232                                             Hamlet  1996

                         name     type character     n
248251            Amy Bourque    actor   Ophelia  11.0
410247         Josie Chisholm    actor   Ophelia   NaN
470859        Crystal Cordero    actor   Ophelia   NaN
866334          Lucas Grabeel    actor   Ophelia   NaN
1364457   Catherine (IV) Lord    actor   Ophelia   NaN
...                       ...      ...       ...   ...
3722298       Marsha Warfield  actress   Ophelia   7.0
3723039  Jennifer Lynn Warren  actress   Ophelia  12.0
3733637       Katie (II) West  actress   Ophelia   7.0
3748118     Helen (IV) Wilson  actress   Ophelia   NaN
3751232          Kate Winslet  actress   Ophelia  46.0

[117 rows x 6 columns]

In [ ]:
0

### How many people have played a role called "The Dude"?

In [82]:
z=data2[data2['character'] == 'The Dude' ]
print('The numbers of people have palyed a role called "The Dude" =  ',len(z))

The numbers of people have palyed a role called "The Dude" =   19

### How many people have played a role called "The Stranger"?

In [109]:
y=data2[data2['character'] == 'The Stranger' ]

x=y.drop_duplicates(subset=['name'])

b=a=len(x.axes[0])

print('The numbers of people have played a role called "The Stranger"= ',b)

The numbers of people have played a role called "The Stranger"=  202

### How many roles has Sidney Poitier played throughout his career?

In [8]:
y=data2[data2['name'] == 'Sidney Poitier' ]
print('The numbers of roles Sidney Poitier has played throughout his career = ',len(y))

The numbers of roles Sidney Poitier has played throughout his career =  43

### How many roles has Judi Dench played?

In [9]:
y=data2[data2['name'] == 'Judi Dench' ]
print('The numbers of roles Judi Dench has played throughout his career = ',len(y))

The numbers of roles Judi Dench has played throughout his career =  55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [12]:
y=data2[data2['name'] == 'Cary Grant' ]
x=y[y['year'] == 1940 ]
z=x[x['n'] == 2 ]
print(z)

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [13]:
y=data2[data2['name'] == 'Cary Grant' ]
x=y[y['year'] == 1940 ]
print(x)

                          title  year        name   type           character  \
871407          His Girl Friday  1940  Cary Grant  actor        Walter Burns
871423         My Favorite Wife  1940  Cary Grant  actor          Nick Arden
871448  The Howards of Virginia  1940  Cary Grant  actor         Matt Howard
871450   The Philadelphia Story  1940  Cary Grant  actor  C. K. Dexter Haven

          n
871407  1.0
871423  2.0
871448  1.0
871450  1.0

### How many roles were available for actors in the 1950s?

In [19]:
y=data2[data2['year'] == 1950 ]
x=len(y['character'])
print(x)

22397

### How many roles were available for actresses in the 1950s?

In [21]:
y=data2[data2['year'] == 1950 ]
x=y[y['type'] == 'actress']
print('The numbers of roles were available for actresses in the 1950 =  ',len(x))

The numbers of roles were available for actresses in the 1950 =   5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [25]:
x=data2[data2['year'] == 1980 ]
z=x[x['n'] == 1 ]
print(len(z))
print(z)

1183
                                     title  year                 name  \
1293                         Il pap'occhio  1980    Diego Abatantuono
1452               Athkiya' laken aghbiya'  1980         Rushdy Abaza
2543                     El Banat Ayza Eih  1980   Mahmoud Abdel Aziz
2558                 X Ma'anah Alamt Khata  1980   Mahmoud Abdel Aziz
2971                             Airplane!  1980  Kareem Abdul-Jabbar
...                                    ...   ...                  ...
3773192                      Majimak milae  1980             Ji-in Yu
3774562               Aduh aduh mana tahan  1980          Diana Yusuf
3779853                      Huang Ying Gu  1980        Jinling Zhang
3785490    Jokosei: natsu hiraku kuchiburu  1980            Ayako ?ta
3785492  Kairaku gakuen: Kinjirareta asobi  1980            Ayako ?ta

            type        character    n
1293       actor   Padre Gabriele  1.0
1452       actor            Hamdi  1.0
2543       actor            Kamal  1.0
2558       actor            Ramzy  1.0
2971       actor    Roger Murdock  1.0
...          ...              ...  ...
3773192  actress  Oh Yeong-kyeong  1.0
3774562  actress            Diana  1.0
3779853  actress     Yinggu Huang  1.0
3785490  actress     Sh?ko Yazaki  1.0
3785492  actress   Sachiko Suzuki  1.0

[1183 rows x 6 columns]

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [33]:
x=data2[data2['year'] == 1980 ]
a=len(x.isna())
print('The numbers of roles through 1980 were minor enough that they did not warrant a numeric "n" rank = ',a)

The numbers of roles through 1980 were minor enough that they did not warrant a numeric "n" rank =  23472